# Brewfile - Homebrew packages for this machine
# Install with: brew bundle --file=Brewfile --no-lock

# Version manager for multiple runtime versions
# Referenced in: shell/.zshrc (path_prepend of asdf shims)
brew "asdf"

# Polyglot dev tool manager (runtimes, env vars, task runner)
brew "mise"

# Pretty, minimal, and fast ZSH prompt
# Referenced in: shell/.zshrc (prompt pure)
brew "pure"

# GNU Privacy Guard - encryption and signing tools
brew "gnupg"

# PostgreSQL client tools without the full server
# Referenced in: shell/.zshrc (libpq PATH)
brew "libpq"

# ZSH shell (newer than macOS built-in)
brew "zsh"

# Fish-like autosuggestions for ZSH
# Referenced in: shell/.zshrc (sourced from Homebrew)
brew "zsh-autosuggestions"

# Fish-like syntax highlighting for ZSH
# Referenced in: shell/.zshrc (sourced from Homebrew)
brew "zsh-syntax-highlighting"

# Lightweight JSON processor
# Referenced in: claude/settings.json (statusLine command)
brew "jq"

# Fast regex-based code search tool
brew "ripgrep"

# GitHub CLI for PR, issue, and repo operations
brew "gh"

# Interactive process viewer
brew "htop"

# Wrapper around ping with colorful output
brew "prettyping"

# AWS command-line interface
brew "awscli"

# Infrastructure as code tool
brew "terraform"

# Google Cloud SQL Auth Proxy
brew "cloud-sql-proxy"

# Vercel deployment CLI
brew "vercel-cli"

# Monospaced font with programming ligatures
cask "font-fira-code"
